| Revue de code                                                  |                                                               |           |    |      |                                                                             |
|                                                                |                                                               |           |    |      |                                                                             |
| Pertinence des commentaires                                    |                                                               |         6 | A  |  6.0 |                                                                             |
| Exhaustivité de la révision                                    |                                                               |         6 | C  |  3.6 | C'est un peu mince...                                                       |
| Formulation appropriée et respectueuse                         |                                                               |         6 | A  |  6.0 |                                                                             |
|----------------------------------------------------------------+---------------------------------------------------------------+-----------+----+------+-----------------------------------------------------------------------------|
| Développement                                                  |                                                               |           |    |      |                                                                             |
|                                                                |                                                               |           |    |      |                                                                             |
| Pertinence et justesse de l’intégration des éléments demandés  |                                                               |           |    |      |                                                                             |
|                                                                | Les erreurs sont correctement représentées par des images     |         5 | A  |  5.0 |                                                                             |
|                                                                | Les boutons «lettres» permettent de faire des essais          |         5 | A  |  5.0 |                                                                             |
|                                                                | Seulement les lettres trouvées sont affichées dans le mot     |         5 | A  |  5.0 |                                                                             |
|                                                                | Il n'est pas possible d'essayer plusieurs fois la même lettre |         5 | A  |  5.0 |                                                                             |
|                                                                | Un bouton «Redémarrer» relance le jeu                         |         5 | A  |  5.0 |                                                                             |
|                                                                | L'interface est internationalisée                             |         5 | A  |  5.0 |                                                                             |
| Qualité de la solution développée                              |                                                               |           |    |      |                                                                             |
|                                                                | La classe Jeu est implémentée selon l'analyse                 |         6 | B+ |  5.2 |                                                                             |
|                                                                | La classe Présentateur est implémentée selon l'analyse        |         6 | A- |  5.6 |                                                                             |
|                                                                | La classe MainActivity implémente la vue seulement            |         6 | A  |  6.0 |                                                                             |
|                                                                | Les méthodes publiques sont documentées                       |         6 | C  |  3.6 | en partie                                                                   |
| Qualité et exhaustivité des tests                              |                                                               |           |    |      |                                                                             |
|                                                                | La classe Jeu est testée par des tests unitaires:             |           |    |      |                                                                             |
|                                                                | Corrects                                                      |         6 | B- |  4.4 |                                                                             |
|                                                                | Complets                                                      |         6 | C  |  3.6 | Il en manque plusieurs                                                      |
|                                                                | Dans le format demandé                                        |         6 | C  |  3.6 | Les noms ne suivent pas le format Gherkin                                   |
| Utilisation adéquate des outils de gestion de projet           |                                                               |           |    |      |                                                                             |
|                                                                | Le travail est séparé en commits                              |         5 | A  |  5.0 |                                                                             |
|                                                                | Les commits sont documentés                                   |         5 | A  |  5.0 | Laisse tomber les numéros de version, Git fait ça pour toi.                 |
|----------------------------------------------------------------+---------------------------------------------------------------+-----------+----+------+-----------------------------------------------------------------------------|
| Qualité du français                                            |                                                               | (max -10) |    |      |                                                                             |
|----------------------------------------------------------------+---------------------------------------------------------------+-----------+----+------+-----------------------------------------------------------------------------|
| Le code respecte les normes de qualité                         |                                                               | (max -20) |    |  -10 | Ton code est difficile à lire à cause de beaucoup de problèmes de formatage |
|----------------------------------------------------------------+---------------------------------------------------------------+-----------+----+------+-----------------------------------------------------------------------------|
| TOTAL                                                          |                                                               |       100 |    | 77.6 |                                                                             |
#+TBLFM: @3$5..@27$5='(if (string= "" $4) "" (format "%2.1f" (* (string-to-number $3) (/ (+ (- 70 (aref $4 0)) (cond ((= (aref (substring $4 -1) 0) ?+) 0.33) ((= (aref (substring $4 -1) 0) ?-) -0.33) (t 0))) 5.0))))'
#+TBLFM: @30$5=vsum(@3..@29)

